<?php

// 从文件中读取数据到PHP变量
$json_string = file_get_contents(resource_path('js/config.json'));


$json_string = preg_replace( '![ \t]*//.*[ \t]*[\r\n]!', '', $json_string );

// 用参数true把JSON字符串强制转成PHP数组
$data = json_decode($json_string, true);

return $data;

//return[
//    //1. 领导
//    //2. 考试学科任课教师
//    //3. 非考试学科任课教师
//    //4. 教辅
//    'specific'=>[
//
//        1=>[
//            'prompt'=>[
//                'positionPoints'=>[
//                    '正校级领导 8 分',
//                    '副校级领导 6 分',
//                    '中层领导 5 分',
//                ],
//                'workloadPoints'=>[
//                    '德育、教务干事，人事档案、财务、伙食管理 1.5 分',
//                    '其他教辅人员 1 分'
//                ],
//                'assessmentPoints'=>[
//                    '1-2',
//                    '3-4',
//                    '5-6',
//                    '7-8',
//                    '9-10',
//                    '11-12',
//                    '13-14',
//                    '15-16',
//                    '17-18',
//                    '19-20',
//                    '21-24',
//                ],
//                'moralityPoints'=>[
//                    '最受欢迎的教师',
//                    '无'
//                ]
//            ],
//            'promptPoints'=>[
//                'positionPoints'=>[
//                    8,6,5
//                ],
//                'workloadPoints'=>[
//                    1.5,1
//                ],
//                'assessmentPoints'=>[
//                    12,
//                    11.8,
//                    11.6,
//                    11.4,
//                    11.2,
//                    11,
//                    10.8,
//                    10.6,
//                    10.4,
//                    10.2,
//                    10,
//                ],
//                'moralityPoints'=> [
//                    2,0
//                ]
//            ],
//        ],
//        2=>[
//            'prompt'=>[
//                'positionPoints'=>[
//                    '（年级组长）班主任 4 分',
//                    '教研组长 1 分',
//                    '备课组长 0.6 分',
//                ],
//                'workloadPoints'=>[
//                    '周 13 课时以上 4 分',
//                    '周 10-12 节以上 3 分',
//                    '周 6-9 节以上 2.5 分',
//                    '周 3-5 节 2.2 分',
//                    '周 1-2 节，活动课，大课教师 2 分',
//                ],
//                'assessmentPoints'=>[
//                    '1-2',
//                    '3-4',
//                    '5-6',
//                    '7-8',
//                    '9-10',
//                    '11-12',
//                    '13-14',
//                    '15-16',
//                    '17-18',
//                    '19-20',
//                    '21-24',
//                ],
//                'moralityPoints'=>[
//                    '最受欢迎的学科教师',
//                    '无'
//                ]
//            ],
//            'promptPoints'=>[
//                'positionPoints'=>[
//                    4,1,0.6
//                ],
//                'workloadPoints'=>[
//                    4,3,2.5,2.2,2
//                ],
//                'assessmentPoints'=>[
//                    12,
//                    11.8,
//                    11.6,
//                    11.4,
//                    11.2,
//                    11,
//                    10.8,
//                    10.6,
//                    10.4,
//                    10.2,
//                    10,
//                ],
//                'moralityPoints'=> [
//                    2,0
//                ]
//            ],
//        ],
//        3=>[
//            'prompt'=>[
//                'positionPoints'=>[
//                    '（年级组长）班主任 4 分',
//                    '教研组长 1 分',
//                    '备课组长 0.6 分',
//                ],
//                'workloadPoints'=>[
//                    '周 13 课时以上 4 分',
//                    '周 10-12 节以上 3 分',
//                    '周 6-9 节以上 2.5 分',
//                    '周 3-5 节 2.2 分',
//                    '周 1-2 节，活动课，大课教师 2 分',
//                ],
//                'assessmentPoints'=>[
//                    '1',
//                    '2',
//                    '3',
//                    '4',
//                    '5',
//                    '6',
//                    '7',
//                    '8',
//                    '9',
//                    '10',
//                    '11',
//                ],
//                'moralityPoints'=>[
//                    '最受欢迎的学科教师',
//                    '无'
//                ]
//            ],
//            'promptPoints'=>[
//                'positionPoints'=>[
//                    4,1,0.6
//                ],
//                'workloadPoints'=>[
//                    4,3,2.5,2.2,2,
//                ],
//                'assessmentPoints'=>[
//                    19.6,
//                    19.2,
//                    18.8,
//                    18.4,
//                    18.0,
//                    17.6,
//                    17.2,
//                    16.8,
//                    16.4,
//                    16.0,
//                    15.6,
//                ],
//                'moralityPoints'=> [
//                    2,0
//                ]
//            ],
//        ],
//        4=>[
//            'prompt'=>[
//                'positionPoints'=>[
//                    '正校级领导 8 分',
//                    '副校级领导 6 分',
//                    '中层领导 5 分',
//                    '（年级组长）班主任 4 分',
//                    '教研组长 1 分',
//                    '备课组长 0.6 分',
//                ],
//                'workloadPoints'=>[
//                    '德育、教务干事，人事档案、财务、伙食管理 1.5 分',
//                    '其他教辅人员 1 分'
//                ],
//                'assessmentPoints'=>[
//                    '1',
//                    '2',
//                    '3',
//                    '4',
//                    '5',
//                    '6',
//                    '7',
//                    '8',
//                    '9',
//                    '10',
//                    '11',
//                ],
//                'moralityPoints'=>[
//                    '最受欢迎的学科教师',
//                    '无'
//                ]
//            ],
//            'promptPoints'=>[
//                'positionPoints'=>[
//                    8,6,5,4,1,0.6
//                ],
//                'workloadPoints'=>[
//                    1.5,1
//                ],
//                'assessmentPoints'=>[
//                    19.6,
//                    19.2,
//                    18.8,
//                    18.4,
//                    18.0,
//                    17.6,
//                    17.2,
//                    16.8,
//                    16.4,
//                    16.0,
//                    15.6,
//                ],
//                'moralityPoints'=> [
//                    2,0
//                ]
//            ],
//        ],
//    ],
//    'common'=>[
//        'qualification'=>2,
//        'kParam'=>1.1,
//        'importantYears'=>1
//    ],
//];
